---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldOffsetY
source: html/7b5ea201-9c3a-ba84-c9ea-4b48f1fa43c8.htm
---
# Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldOffsetY Property

The property labeled "Offset Y" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetY { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".